Table of Contents:
1. Importing Libraries
2. Setting path variable and Loading Data
3. Identify PII(Personally Identifiable Info
4. Adding new column Region from column state 
5. create crosstab between region and spend_flag
6. create activity flag for customers based on maxorders < and > 5
7. Exporting Data

1. Importing Libraries

In [2]:
# importing libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

2. Setting path variable and Loading Data

In [2]:
# setting path variable as root
path = r'C:\Users\shrut\Downloads\Task_data_analytics\Instacart Basket Analysis'

In [3]:
# load data
ord_prod_cust = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_customer_merge.pkl'))

3. Identify PII(Personally Identifiable Info :

In [5]:
# Drop first_name and surname as it is not required in analysis
ord_prod_cust.drop(columns = {'first_name', 'surname'}, inplace = True)

In [8]:
ord_prod_cust.drop(columns = {'_merge'}, inplace = True)

In [11]:
ord_prod_cust.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_previous_order,product_id,add_to_cart_order,reordered,product_name,...,spend_flag,median_days_prev_order,regularity_flag,gender,state,age,date_joined,num_of_dependants,marital_status,income
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Low Spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,Low Spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,Low Spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Low Spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,Low Spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423

In [10]:
ord_prod_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32434212 entries, 0 to 32434211
Data columns (total 29 columns):
 #   Column                     Dtype
---  ------                     -----
 0   order_id                   int32
 1   user_id                    int32
 2   order_number               int8
 3   orders_day_of_week         int8
 4   order_hour_of_day          int8
 5   days_since_previous_order  float16
 6   product_id                 int32
 7   add_to_cart_order          int32
 8   reordered                  int8
 9   product_name               object
 10  aisle_id                   int8
 11  department_id              int8
 12  prices                     float64
 13  busiest_day                object
 14  busiest_days               object
 15  busiest_period_of_day      object
 16  max_order                  int8
 17  loyalty_flag               object
 18  mean_price                 float64
 19  spend_flag                 object
 20  median_days_prev_order     float16
 21  regularity_flag            object
 22  gender                     object
 23  state                      object
 24  age                        int8
 25  date_joined                object
 26  num_of_dependants          int8
 27  marital_status             object
 28  income                     int64
dtypes: float16(2), float64(2), int32(4), int64(1), int8(9), object(11)
memory usage: 4.3+ GB

4. Adding new column Region from column state

    # Define Regions

In [12]:
NorthEast = ['Maine', 'New Hampshire', 'Vermont', 'Massachusetts', 'Rhode Island', 'Connecticut', 'New York', 'Pennsylvania', 'New Jersey']

In [13]:
MidWest = ['Wisconsin', 'Michigan', 'Illinois', 'Indiana', 'Ohio', 'North Dakota', 'South Dakota', 'Nebraska', 'Kansas', 'Minnesota', 'Iowa', 'Missouri']

In [14]:
South = ['Delaware', 'Maryland', 'District of Columbia', 'Virginia', 'West Virginia', 'North Carolina', 'South Carolina', 'Georgia', 'Florida', 'Kentucky', 'Tennessee', 'Mississippi', 'Alabama', 'Oklahoma', 'Texas', 'Arkansas', 'Louisiana']

In [15]:
West = ['Idaho', 'Montana', 'Wyoming', 'Nevada', 'Utah', 'Colorado', 'Arizona', 'New Mexico', 'Alaska', 'Washington', 'Oregon', 'California', 'Hawaii']

In [17]:
# Add entry to new column
ord_prod_cust.loc[ord_prod_cust['state'].isin(NorthEast), 'region'] = 'NorthEast'

C:\Users\shrut\AppData\Local\Temp\ipykernel_24300\3794916376.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'NorthEast' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  ord_prod_cust.loc[ord_prod_cust['state'].isin(NorthEast), 'region'] = 'NorthEast'

In [18]:
ord_prod_cust.loc[ord_prod_cust['state'].isin(MidWest), 'region'] = 'MidWest'

In [19]:
ord_prod_cust.loc[ord_prod_cust['state'].isin(South), 'region'] = 'South'

In [20]:
ord_prod_cust.loc[ord_prod_cust['state'].isin(West), 'region'] = 'West'

In [21]:
ord_prod_cust['region'].value_counts(dropna=False)

region
South        10801610
West          8300445
MidWest       7603810
NorthEast     5728347
Name: count, dtype: int64

    # Total seems to be total rows count

In [22]:
ord_prod_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32434212 entries, 0 to 32434211
Data columns (total 30 columns):
 #   Column                     Dtype
---  ------                     -----
 0   order_id                   int32
 1   user_id                    int32
 2   order_number               int8
 3   orders_day_of_week         int8
 4   order_hour_of_day          int8
 5   days_since_previous_order  float16
 6   product_id                 int32
 7   add_to_cart_order          int32
 8   reordered                  int8
 9   product_name               object
 10  aisle_id                   int8
 11  department_id              int8
 12  prices                     float64
 13  busiest_day                object
 14  busiest_days               object
 15  busiest_period_of_day      object
 16  max_order                  int8
 17  loyalty_flag               object
 18  mean_price                 float64
 19  spend_flag                 object
 20  median_days_prev_order     float16
 21  regularity_flag            object
 22  gender                     object
 23  state                      object
 24  age                        int8
 25  date_joined                object
 26  num_of_dependants          int8
 27  marital_status             object
 28  income                     int64
 29  region                     object
dtypes: float16(2), float64(2), int32(4), int64(1), int8(9), object(12)
memory usage: 4.5+ GB

5. create crosstab between region and spend_flag

In [23]:
crosstab = pd.crosstab(ord_prod_cust['spend_flag'], ord_prod_cust['region'], dropna = False)

In [24]:
crosstab.to_clipboard()

In [25]:
crosstab

region        MidWest  NorthEast     South     West
spend_flag
High Spender   140326      98295    187507   142499
Low Spender   7463484    5630052  10614103  8157946

    # The South has more number of Low Spenders, followed by west, midwest and northeast

6. create activity flag for customers based on maxorders < and > 5

In [26]:
ord_prod_cust.loc[ord_prod_cust['max_order'] < 5, 'activity_flag'] = 'low activity'

C:\Users\shrut\AppData\Local\Temp\ipykernel_24300\3218154257.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'low activity' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  ord_prod_cust.loc[ord_prod_cust['max_order'] < 5, 'activity_flag'] = 'low activity'

In [27]:
ord_prod_cust.loc[ord_prod_cust['max_order'] >= 5, 'activity_flag'] = 'high activity'

In [28]:
df_low_activity = ord_prod_cust[ord_prod_cust['activity_flag'] == 'low activity']

In [29]:
df_low_activity.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_previous_order,product_id,add_to_cart_order,reordered,product_name,...,regularity_flag,gender,state,age,date_joined,num_of_dependants,marital_status,income,region,activity_flag
1513,520620,120,1,3,11,NaN,196,2,0,Soda,...,Regular customer,Female,Kentucky,54,3/2/2017,2,married,99219,South,low activity
1514,3273029,120,3,2,8,19.0,196,2,1,Soda,...,Regular customer,Female,Kentucky,54,3/2/2017,2,married,99219,South,low activity
1515,520620,120,1,3,11,NaN,46149,1,0,Zero Calorie Cola,...,Regular customer,Female,Kentucky,54,3/2/2017,2,married,99219,South,low activity
1516,3273029,120,3,2,8,19.0,46149,1,1,Zero Calorie Cola,...,Regular customer,Female,Kentucky,54,3/2/2017,2,married,99219,South,low activity
1517,520620,120,1,3,11,NaN,26348,3,0,Mixed Fruit Fruit Snacks,...,Regular customer,Female,Kentucky,54,3/2/2017,2,married,99219,South,low activity

In [30]:
df_high_activity = ord_prod_cust[ord_prod_cust['activity_flag'] == 'high activity']

7. Exporting Data

In [33]:
# Saving the low activity customers as a pickle. 
df_low_activity.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'df_low_activity_cutomers.pkl'))

In [34]:
# Saving the low activity customers as a pickle. 
df_high_activity.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'df_high_activity_cutomers.pkl'))